In [1]:
import sqlalchemy as db
from sqlalchemy import create_engine

In [11]:
engine = db.create_engine('sqlite:///C:\\Users\\peter\\Documents\\Projekte\\Zähler\\tc_all_new_test.db')

In [12]:
conn = engine.connect()

In [13]:
import pandas as pd

### Erst einmal alle Tabellen auflisten

In [14]:
qt = " SELECT name FROM sqlite_master WHERE type='table' "

In [15]:
df = pd.read_sql_query(qt, conn)

In [16]:
df

                 name
0             tcsites
1   tcdata_CH_0529_05
2   tcdata_CH_0529_04
3   tcdata_CH_0529_03
4   tcdata_CH_0529_02
..                ...
71  tcdata_CH_0287_01
72  tcdata_CH_0287_02
73  tcdata_CH_0287_03
74  tcdata_CH_0287_04
75  tcdata_CH_0286_06

[76 rows x 1 columns]

In [52]:
query ='''
SELECT 
    rowid as id, time as TIME
    FROM tcdata_CH_0084_01
    GROUP BY time
    HAVING COUNT() > 1
 '''

In [53]:
df = pd.read_sql_query(query, conn)

In [54]:
df.head()

       id                       TIME
0  132104  2022-03-17 05:44:00+01:00
1  132138  2022-03-17 06:18:00+01:00
2  132233  2022-03-17 07:53:00+01:00
3  132497  2022-03-17 17:53:00+01:00
4  132809  2022-03-18 07:53:00+01:00

In [51]:
df.describe()

                  id
count       3.000000
mean   158288.333333
std       132.831974
min    158146.000000
25%    158228.000000
50%    158310.000000
75%    158359.500000
max    158409.000000

### OK, für die Spur 0084_01 habe ich 208 Multiples in einem Dataframe. Jetzt möchte ich eine Schleife programmieren, welche auf Basis der rowid eine Reihe entfernt

In [21]:
from sqlalchemy import delete

In [22]:
lst=df['id']

In [23]:
lst[0:8]

0    132104
1    132138
2    132233
3    132497
4    132809
5    133073
6    133385
7    133649
Name: id, dtype: int64

In [185]:
for t in lst:
    dq = "DELETE FROM tcdata_CH_0243_04 WHERE rowid = " + str(t)
    conn.execute(dq)

## Das hat funktioniert, aber die Anzahl der Multiples lag teilweise bei ca. 20!!! Mal gucken, wie ich das löse...

### Im Grunde brauche ich eine Liste von allen Spuren, über die ich loopen kann...

### ... und diese Liste kann ich dann auch für die Steckbriefe pro Spur/Zähler verwenden!

In [13]:
q ='''
SELECT 
    COUNT(DISTINCT time)
    FROM tcdata_CH_0084_01
 '''

In [14]:
res = conn.execute(q)

In [15]:
res.fetchone()

(67911,)

In [16]:
q ='''
SELECT 
    COUNT()
    FROM tcdata_CH_0084_01
 '''

In [17]:
res = conn.execute(q)

In [18]:
res.fetchone()

(67911,)